results/run-100vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m00.9s/1m0s

running (0m01.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m01.9s/1m0s

running (0m02.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m02.9s/1m0s

running (0m03.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m03.9s/1m0s

running (0m04.9s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m04.9s/1m0s

running (0m05.9s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m05.9s/1m0s

running (0m06.9s), 100/100 VUs, 200 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m06.9s/1m0s

running (0m07.9s), 100/100 VUs, 254 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m07.9s/1m0s

running (0m08.9s), 100/100 VUs, 259 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m08.9s/1m0s

running (0m09.9s), 100/100 VUs, 307 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m09.9s/1m0s

running (0m10.9s), 100/100 VUs, 309 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m10.9s/1m0s

running (0m11.9s), 100/100 VUs, 320 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m11.9s/1m0s

running (0m12.9s), 100/100 VUs, 361 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m12.9s/1m0s

running (0m13.9s), 100/100 VUs, 381 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m13.9s/1m0s

running (0m14.9s), 100/100 VUs, 422 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m14.9s/1m0s

running (0m15.9s), 100/100 VUs, 454 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m15.9s/1m0s

running (0m16.9s), 100/100 VUs, 491 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m16.9s/1m0s

running (0m17.9s), 100/100 VUs, 523 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m17.9s/1m0s

running (0m18.9s), 100/100 VUs, 580 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m18.9s/1m0s

running (0m19.9s), 100/100 VUs, 647 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m19.9s/1m0s

running (0m20.9s), 100/100 VUs, 718 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m20.9s/1m0s

running (0m21.9s), 100/100 VUs, 777 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m21.9s/1m0s

running (0m22.9s), 100/100 VUs, 863 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m22.9s/1m0s

running (0m23.9s), 100/100 VUs, 944 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m23.9s/1m0s

running (0m24.9s), 100/100 VUs, 1002 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m24.9s/1m0s

running (0m25.9s), 100/100 VUs, 1078 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m25.9s/1m0s

running (0m26.9s), 100/100 VUs, 1131 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m26.9s/1m0s

running (0m27.9s), 100/100 VUs, 1219 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m27.9s/1m0s

running (0m28.9s), 100/100 VUs, 1314 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m28.9s/1m0s

running (0m29.9s), 100/100 VUs, 1378 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m29.9s/1m0s

running (0m30.9s), 100/100 VUs, 1436 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m30.9s/1m0s

running (0m31.9s), 100/100 VUs, 1519 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m31.9s/1m0s

running (0m32.9s), 100/100 VUs, 1619 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m32.9s/1m0s

running (0m33.9s), 100/100 VUs, 1672 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m33.9s/1m0s

running (0m34.9s), 100/100 VUs, 1729 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m34.9s/1m0s

running (0m35.9s), 100/100 VUs, 1818 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m35.9s/1m0s

running (0m36.9s), 100/100 VUs, 1885 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m36.9s/1m0s

running (0m37.9s), 100/100 VUs, 1974 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m37.9s/1m0s

running (0m38.9s), 100/100 VUs, 2019 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m38.9s/1m0s

running (0m39.9s), 100/100 VUs, 2118 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m39.9s/1m0s

running (0m40.9s), 100/100 VUs, 2201 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m40.9s/1m0s

running (0m41.9s), 100/100 VUs, 2255 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m41.9s/1m0s

running (0m42.9s), 100/100 VUs, 2318 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m42.9s/1m0s

running (0m43.9s), 100/100 VUs, 2374 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m43.9s/1m0s

running (0m44.9s), 100/100 VUs, 2415 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m44.9s/1m0s

running (0m45.9s), 100/100 VUs, 2455 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m45.9s/1m0s

running (0m46.9s), 100/100 VUs, 2517 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m46.9s/1m0s

running (0m47.9s), 100/100 VUs, 2558 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m47.9s/1m0s

running (0m48.9s), 100/100 VUs, 2592 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m48.9s/1m0s

running (0m49.9s), 100/100 VUs, 2658 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m49.9s/1m0s

running (0m50.9s), 100/100 VUs, 2758 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m50.9s/1m0s

running (0m51.9s), 100/100 VUs, 2818 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m51.9s/1m0s

running (0m52.9s), 100/100 VUs, 2858 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m52.9s/1m0s

running (0m53.9s), 100/100 VUs, 2958 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m53.9s/1m0s

running (0m54.9s), 100/100 VUs, 2981 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m54.9s/1m0s

running (0m55.9s), 100/100 VUs, 3061 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m55.9s/1m0s

running (0m56.9s), 100/100 VUs, 3133 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m56.9s/1m0s

running (0m57.9s), 100/100 VUs, 3189 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m57.9s/1m0s

running (0m58.9s), 100/100 VUs, 3265 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m58.9s/1m0s

running (0m59.9s), 100/100 VUs, 3304 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  0m59.9s/1m0s

running (1m00.9s), 027/100 VUs, 3384 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 3411    55.163869/s
    checks_succeeded...: 100.00% 3411 out of 3411
    checks_failed......: 0.00%   0 out of 3411

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=350.47ms min=53.32ms med=233.37ms max=7.25s p(90)=599.23ms p(95)=1.17s
      { expected_response:true }...: avg=350.47ms min=53.32ms med=233.37ms max=7.25s p(90)=599.23ms p(95)=1.17s
    http_req_failed................: 0.00%  0 out of 6822
    http_reqs......................: 6822   110.327739/s

    EXECUTION
    iteration_duration.............: avg=1.78s    min=1.27s   med=1.4s     max=8.75s p(90)=2.59s    p(95)=4.6s 
    iterations.....................: 3411   55.163869/s
    vus............................: 27     min=27        max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 13 MB  215 kB/s
    data_sent......................: 656 kB 11 kB/s



running (1m01.8s), 000/100 VUs, 3411 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s